[  "properties": [
        {
          "id": 298104,
          "address": "Unit 108 120 Southgate Drive",
          "bedrooms": 2,
          "gla": 1352,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B4A 0B1",
          "property_sub_type": "Condo Apartment",
          "structure_type": "Condominium",
          "style": "Multiplex",
          "levels": "Multiplex",
          "room_count": 3,
          "full_baths": 2,
          "half_baths": 0,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": null,
          "year_built": 2007,
          "roof": "Asphalt Shingle",
          "basement": "Fully Developed",
          "cooling": "Baseboard, Hot Water, Ducted Cooling",
          "heating": "Baseboard, Hot Water, Ducted Cooling",
          "close_price": 540000.0,
          "close_date": "2025-01-17",
          "public_remarks": "Welcome to 120 South Gate #108, an immaculate main-floor suite in the desirable”Ravines\" in Bedford. This stunning 2-bedroom, 2-bathroom condo plus den offers a blend of modern comfort and serene surroundings, with floor-to-ceiling windows showcasing the greenbelt of trees and nearby walking trails. This spacious open-concept unit features two bedrooms on opposite ends for privacy. The master bedroom boasts a recently updated ensuite and a generous walk-in closet, while the second bedroom has its own 4-piece bath. Natural Gas hot water baseboard heating for warmth and Air Conditioning included in condo fee for added comfort. The versatile den can serve as an office or added storage.  Step out onto your private balcony, which is perfect for relaxing and using a propane BBQ. The building amenities are unparalleled, with a gym, workshop, underground car wash, library, party room, guest suite, and a spectacular rooftop patio offering panoramic views of Bedford Mill Cove. Included with the unit are an assigned underground parking space, additional outdoor parking, and a storage room. Condo fees cover heat, water, A/C, a live-in superintendent, snow removal, landscaping, and maintenance of all building amenities. Don’t miss out on this rare opportunity to enjoy luxurious, worry-free living in Bedford’s finest community!",
          "latitude": 44.7093,
          "longitude": -63.6745
        },
        {
          "id": 298320,
          "address": "Unit 714 90 Moirs Mills Road",
          "bedrooms": 2,
          "gla": 1160,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B4A 3Y2",
          "property_sub_type": "Condo Apartment",
          "structure_type": "Condominium",
          "style": "Multiplex",
          "levels": "Multiplex",
          "room_count": 5,
          "full_baths": 2,
          "half_baths": 0,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": null,
          "year_built": 1991,
          "roof": "Asphalt Shingle",
          "basement": "None",
          "cooling": "Baseboard",
          "heating": "Baseboard",
          "close_price": 358700.0,
          "close_date": "2025-01-22",
          "public_remarks": "The Condos at Moirs Mill are sought after for their convenience and location! Convenient to everything Bedford has to offer including great schools, beaches, shopping and restaurants. The location gives easy access to Downtown as well as highways to get out of the city or travel. With a tennis court and a great in-ground pool, lots of entertainment is near at hand on the Condo property. The unit itself has a large living space with access to the deck. The primary bedroom also has a door to the deck and its own ensuite. A large second bedroom, full bath, in suite laundry and in suite storage complete the unit. Book your showing to see the potential in person!",
          "latitude": 44.7114,
          "longitude": -63.6812
        },
        {
          "id": 298100,
          "address": "Unit 721 38 Hammonds Plains Road",
          "bedrooms": 2,
          "gla": 987,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B4A 3P7",
          "property_sub_type": "Condo Apartment",
          "structure_type": "Condominium",
          "style": "Multiplex",
          "levels": "Multiplex",
          "room_count": 5,
          "full_baths": 1,
          "half_baths": 0,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": null,
          "year_built": 1990,
          "roof": "None",
          "basement": "None",
          "cooling": "Baseboard",
          "heating": "Baseboard",
          "close_price": 357000.0,
          "close_date": "2025-01-23",
          "public_remarks": "Looking to downsize or purchase your first home? Don’t miss out on this well-maintained 2-bedroom condo located in the heart of Bedford. The spacious kitchen features stainless steel appliances including new dishwasher and overlooks the bright, open living and dining areas, making it ideal for both everyday living and entertaining. This unit offers two comfortable bedrooms, with the primary bedroom boasting a walk-in closet. The full bathroom includes a relaxing soaker tub, and the convenience of in-unit laundry adds extra appeal. Freshly painted with new flooring throughout, the condo is filled with natural light. A private balcony perfect for BBQing, an extra storage room, and plenty of closet space round out the practical layout. Residents also enjoy access to a secluded inground pool and patio area for relaxation. The building is located within walking distance to shopping, restaurants, Tim Hortons, and metro transit. Future plans for a high-speed ferry and close proximity to the Bedford Waterfront make this an ideal place to call home.",
          "latitude": 44.7154,
          "longitude": -63.6804
        },
        {
          "id": 298098,
          "address": "Unit 211 118 Rutledge Street",
          "bedrooms": 2,
          "gla": 950,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B4A 1X6",
          "property_sub_type": "Condo Apartment",
          "structure_type": "Condominium",
          "style": "1 Level",
          "levels": "1 Level",
          "room_count": 8,
          "full_baths": 1,
          "half_baths": 0,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": null,
          "year_built": 1989,
          "roof": "Asphalt Shingle",
          "basement": "None",
          "cooling": "Baseboard",
          "heating": "Baseboard",
          "close_price": 308000.0,
          "close_date": "2025-01-24",
          "public_remarks": "Welcome to unit 211 at 118 Rutledge street! A great location 2 Bedrooms with 1 full bathroom condo in Bedford, its bright and spacious living/dining room combined with kitchen. The open concept layout allows the light from the balcony to flood the space, creating a warm and inviting atmosphere. The primary bedroom provide large walk-in closet while the second bedroom offers versatility as a guest room, home office, or den. Step out onto the covered deck to enjoy peaceful outdoor dining or relaxation. With in-suite laundry and underground parking, this condo provides everything you need. It is an excellent opportunity for first-time buyers, downsizers, or investors. Don't miss out on the chance to own this fantastic property in the heart of Bedford!",
          "latitude": 44.7276,
          "longitude": -63.6714
        },
        {
          "id": 298292,
          "address": "Unit 209 118 Rutledge Street",
          "bedrooms": 2,
          "gla": 950,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B4A 1X6",
          "property_sub_type": "Condo Apartment",
          "structure_type": "Condominium",
          "style": "Multiplex",
          "levels": "Multiplex",
          "room_count": 4,
          "full_baths": 1,
          "half_baths": 0,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": null,
          "year_built": 1991,
          "roof": "Asphalt Shingle",
          "basement": "None",
          "cooling": "Baseboard",
          "heating": "Baseboard",
          "close_price": 307500.0,
          "close_date": "2025-01-27",
          "public_remarks": "Here is your chance to live in a larger 2 bedroom open-concept condo in the heart of Bedford! The great room is bright and inviting with lots of space in every room. The bedrooms are very large with a huge walk-in closet in the primary bedroom. The laundry is separate from the bathroom and there are a few other closets to help with storage. There is a ceiling fan to help with the warmer Halifax weather and a nice large patio with a privacy wall to enjoy your morning coffees or evening breezes. With heated underground parking this condo has it all. Currently under lease until April 30th.",
          "latitude": 44.7276,
          "longitude": -63.6714
        },
        {
          "id": 297249,
          "address": "9 Kennedy Court",
          "bedrooms": 4,
          "gla": 1206,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B4A 3K6",
          "property_sub_type": "Detached",
          "structure_type": "Single Family",
          "style": "Split Entry",
          "levels": "Split Entry",
          "room_count": 11,
          "full_baths": 2,
          "half_baths": 1,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": 8776.0,
          "year_built": 1987,
          "roof": "Asphalt Shingle",
          "basement": "Fully Developed, Walkout",
          "cooling": "Baseboard, Heat Pump",
          "heating": "Baseboard, Heat Pump",
          "close_price": 658750.0,
          "close_date": "2025-01-31",
          "public_remarks": "Stunning Family Home in the Heart of Bedford** Welcome to your dream home nestled in a fantastic neighborhood in Bedford! This charming residence offers the perfect blend of comfort, convenience, and tranquility. Located just a minute from Highway 102, commuting is a breeze, while a short walk down Hammonds Plains Road takes you to a variety of amenities, ensuring you're never far from what you need. Situated on a quiet court and surrounded by lush nature, this home is an oasis of calm. The built-in garage provides easy access and storage, making your daily routines effortless. With three spacious bedrooms on the upper level, plus an additional room on the lower level, there’s plenty of space for family and guests. The home features two and a half updated bathrooms, as well as new windows and doors throughout, enhancing energy efficiency and aesthetic appeal. You’ll adore the beautifully updated flooring that flows seamlessly throughout the main areas of the house. Prepare to be impressed by the bright and inviting kitchen, designed for both style and functionality. The great family layout offers extra living space in the lower level, which boasts a cozy family room equipped with a charming wood stove, perfect for gathering around on cooler evenings. With ample storage options throughout the home, you’ll find a perfect spot for all your belongings. Experience the serenity and peacefulness that comes with living in this quiet area while enjoying the convenience of nearby amenities. This fantastic home is a must-see for anyone seeking a harmonious blend of comfort, style, and nature. Don’t miss the opportunity to make it yours - it truly Feels Like Home!",
          "latitude": 44.7194,
          "longitude": -63.6831
        },
        {
          "id": 298202,
          "address": "Unit 222 24 Hammonds Plains Road",
          "bedrooms": 2,
          "gla": 945,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B4A 3P3",
          "property_sub_type": "Condo Apartment",
          "structure_type": "Condominium",
          "style": "Multiplex",
          "levels": "Multiplex",
          "room_count": 6,
          "full_baths": 1,
          "half_baths": 0,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": null,
          "year_built": 1990,
          "roof": "Asphalt Shingle",
          "basement": "None",
          "cooling": "Baseboard",
          "heating": "Baseboard",
          "close_price": 338400.0,
          "close_date": "2025-02-06",
          "public_remarks": "Welcome to unit 222 at 24 Hammonds Plains Road! Nestled in the highly desirable Bedford community, this condo offers access to an excellent school district. Featuring 2 bedrooms and 1 bathroom, this immaculate residence has undergone numerous upgrades, including a brand-new tub, vanity, stylish tiles, fresh paint throughout the living area, kitchen, and bathroom, as well as modernized light fixtures. The well-designed layout is clean, Step outside onto the charming balcony, where you can enjoy peaceful views of the lush wooded backyard and listen to the soothing sounds of a nearby brook. Your condo fees cover a range of amenities, including maintenance of the outdoor pool, an assigned parking spot, and access to a shared BBQ, not to mention summer and winter yard maintenance. This community-centric location is perfect for anyone looking for a vibrant lifestyle. For golf enthusiasts, Ashburn Golf Club is less than 15 minutes away, featuring a rich history and memberships that provide access to 10 courses across Canada. If you love sailing, the Bedford Basin Yacht Club, a beloved local attraction for over 60 years, is just a quick 5-minute drive. For beach lovers, Papermill Lake is a short walk away, along with Kearney Lake Beach, just 8 minutes from your door. Living here means you are minutes away from all essential amenities such as grocery stores, pharmacies, medical clinics, salons, animal hospitals, dollar stores, gas stations, restaurants, and cafes. The Lebrun Recreation Centre, only a 10-minute walk, offers hockey games and open skating. Additionally, the famous DeWolf Park, known as the Bedford Waterfront, is also a mere 10 minutes away, showcasing the beauty of the Bedford Basin. With such an ideal location and countless local offerings, this condo is truly a remarkable place to call home! Plus, you'll have easy access to Highway 102, making travel a breeze.",
          "latitude": 44.7146,
          "longitude": -63.6798
        },
        {
          "id": 298022,
          "address": "Unit 300 61 Nelsons Landing Boulevard",
          "bedrooms": 3,
          "gla": 1311,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B4A 3X3",
          "property_sub_type": "Condo Apartment",
          "structure_type": "Condominium",
          "style": "Multiplex",
          "levels": "Multiplex",
          "room_count": 8,
          "full_baths": 2,
          "half_baths": 0,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": null,
          "year_built": 1994,
          "roof": "Metal, Rolled",
          "basement": "None",
          "cooling": "Baseboard",
          "heating": "Baseboard",
          "close_price": 378000.0,
          "close_date": "2025-02-14",
          "public_remarks": "Spacious 3 bedroom corner unit condominium with 2 full baths centrally located within Bedford. This condo is ideal for family living and close to all amenities - schools, shopping, parks, restaurants and much more. Updates over the past two years include: washer/dryer combo, dishwasher, crown mouldings, flooring, lighting fixtures and painting. The building is pet friendly and has a live-in superintendent who makes sure the building is clean and well maintained. Enjoy the building common area amenities including the weight room and exterior seasonal pool. Each unit has a storage space located on the lower floor. The assigned parking space (#136) is located close to the main door making for easy access to the building. Book your showing and make your move to unit 300 at 61 Nelsons Landing Blvd.",
          "latitude": 44.7119,
          "longitude": -63.6779
        },
        {
          "id": 298545,
          "address": "Unit 509 220 Waterfront Drive",
          "bedrooms": 2,
          "gla": 1382,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B4A 0H3",
          "property_sub_type": "Condo Apartment",
          "structure_type": "Condominium",
          "style": "Multiplex",
          "levels": "Multiplex",
          "room_count": 3,
          "full_baths": 2,
          "half_baths": 0,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": null,
          "year_built": 2013,
          "roof": "Other, Metal",
          "basement": "None",
          "cooling": "Baseboard, Heat Pump",
          "heating": "Baseboard, Heat Pump",
          "close_price": 640000.0,
          "close_date": "2025-02-18",
          "public_remarks": "Welcome to Suite 509, your dream home in the highly sought-after Dockside Condos on Waterfront Drive in Bedford. This unit has been professionally designed to create a sophisticated atmosphere from the moment you step inside. An array of luxurious upgrades enhances its appeal, including ceiling-height cabinets, stunning quartz and marble countertops, a fresh coat of paint throughout, and a newly designed laundry room. Step outside onto your expansive 195 sq. ft. balcony, perfect for soaking in picturesque views of the Bedford Basin. The seamless integration of the living and dining areas creates an inviting space ideal for entertaining guests. The immaculate kitchen is equipped with a generous quartz peninsula, stainless steel appliances, and elegant shaker-style cabinetry. Retreat to the spacious primary bedroom, featuring a large walk-in closet and a luxurious en suite bathroom complete with a soaker tub, a separate shower, and a stylish double vanity. The well-proportioned second bedroom offers versatility as a guest room or home office and is conveniently located near the second full bathroom. Additionally, there is a den that can easily serve as an exercise room or office. As a resident of Dockside, you'll enjoy a variety of amenities, including a fitness center, a party room with kitchen facilities, and a heated saltwater pool overlooking the marina. With a live-in superintendent, you can rest easy knowing your needs will be well taken care of. Nestled in the charming community of Bedford, you'll find a wealth of conveniences just a short walk away. Enjoy leisurely strolls along the boardwalk, exploring the nearby yacht club, and accessing various shopping amenities. Don’t miss this incredible opportunity to own a piece of waterfront paradise in Bedford. Schedule your viewing today and experience living at its finest!",
          "latitude": 44.715,
          "longitude": -63.6732
        },
        {
          "id": 298812,
          "address": "Unit 104 80 Waterfront Drive",
          "bedrooms": 2,
          "gla": 1220,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B4A 4E4",
          "property_sub_type": "Condo Apartment",
          "structure_type": "Condominium",
          "style": "Multiplex",
          "levels": "Multiplex",
          "room_count": 9,
          "full_baths": 2,
          "half_baths": 0,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": null,
          "year_built": 1999,
          "roof": "Metal",
          "basement": "None",
          "cooling": "Baseboard, Hot Water",
          "heating": "Baseboard, Hot Water",
          "close_price": 489900.0,
          "close_date": "2025-02-21",
          "public_remarks": "Welcome to the condos at Queens Gate! Unit 104 at 80 Waterfront Drive offers an exceptional opportunity to enjoy waterfront living in the heart of Bedford. This spacious 2 bedroom, 2 bathroom condo features a thoughtfully designed layout, updated finishes and abundant natural light with windows on both sides of the building. The galley kitchen has been beautifully updated with Corian countertops, additional cabinetry and the cozy dining nook. The dining room flows seamlessly into the living area, offering the perfect space for relaxing or entertaining. Step out onto the oversized terrace, which boasts park views and provides a tranquil setting to enjoy your morning coffee or unwind in the evening. The primary bedroom includes a private den/office with French doors, ideal for working from home or as a quiet retreat. The ensuite bath, also updated with Corian counters, adds a touch of luxury. The second bedroom is thoughtfully positioned for privacy away from the primary with another full bathroom also featuring Corian countertops. Additional conveniences include in-suite laundry, in-unit storage room and assigned underground parking conveniently located near the elevator. The oversized terrace is larger than the balconies in the building! A generous 13’ x 6’ storage locker provides even more space. This pet-friendly, non-smoking building is steps from DeWolf Park, walking paths and a playground making it perfect for anyone seeking a blend of nature and urban amenities. With solid financials, a well-managed condo board and a highly desirable location, Unit 104 is a great find. Don’t miss your chance to own this incredible property in Bedford’s vibrant waterfront community!",
          "latitude": 44.7184,
          "longitude": -63.6717
        },
        {
          "id": 298361,
          "address": "Unit 301 51 Wimbledon Road",
          "bedrooms": 2,
          "gla": 1080,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B4A 3M7",
          "property_sub_type": "Condo Apartment",
          "structure_type": "Condominium",
          "style": "Other",
          "levels": "Other",
          "room_count": 6,
          "full_baths": 2,
          "half_baths": 0,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": null,
          "year_built": 1986,
          "roof": "Asphalt Shingle, Metal",
          "basement": "Fully Developed, Walkout",
          "cooling": "Baseboard",
          "heating": "Baseboard",
          "close_price": 379900.0,
          "close_date": "2025-03-12",
          "public_remarks": "Nestled in one of Bedford's most sought-after neighborhoods, this inviting 2-bedroom condo offers the perfect blend of convenience and tranquility. Located close to all amenities, you'll enjoy easy access to shopping, dining, and entertainment, all while coming home to a serene, park-like setting. The spacious primary bedroom features a walk-in closet and a private ensuite, creating a personal retreat within the home. The second bedroom is perfect for guests, a home office, or additional living space. Relax and unwind in the bright dining area, where sliding doors lead to an enclosed deck – the perfect spot to enjoy your morning coffee or watch deer wander through the well-treed surroundings. With the unit facing the peaceful back of the building, you'll have a front-row seat to nature's beauty. Don’t miss this rare opportunity to experience condo living with a touch of woodland charm. Book your showing today!",
          "latitude": 44.724,
          "longitude": -63.6761
        },
        {
          "id": 297686,
          "address": "390 Shore Drive",
          "bedrooms": 4,
          "gla": 2346,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B4A 2C6",
          "property_sub_type": "Semi-Detached",
          "structure_type": "Single Family",
          "style": "3 Level",
          "levels": "3 Level",
          "room_count": 4,
          "full_baths": 4,
          "half_baths": 1,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": 3610.0,
          "year_built": null,
          "roof": "Asphalt Shingle",
          "basement": "Fully Developed",
          "cooling": "Heat Pump",
          "heating": "Heat Pump",
          "close_price": 1399900.0,
          "close_date": "2025-03-14",
          "public_remarks": "Welcome to Marina Vista!  Another opportunity to live on Beautiful Shore Drive in Bedford.  390 Shore Drive is now available with spectacular water views located directly across from Bedford Basin Yacht Club. This home has elegance, class and style.  A three year social membership is included for the Yacht Club. Enjoy the lifestyle that this home presents.  Open concept design with amazing views of the Bedford Basin.  3 bedrooms up each with their own ensuite!  Master is divine with vaulted 12 foot ceiling, a beautiful balcony to enjoy your morning coffee or evening nightcap while enjoying the view. Ensuite has a double custom shower. A Lovely laundry room on the second level. Main level is open concept with a fabulous view of the marina and Bedford Basin with its picturesque sail boats.  Gorgeous kitchen with large island and a huge pantry with extra sink and fridge space.  The main entry level consists of a separate suite that can serve as a rec room, gym or office space including a wet bar and a full bath adjoining the fourth bedroom.  Come and see this beautiful high end home with quality finishes inside and out!",
          "latitude": 44.7269,
          "longitude": -63.665
        },
        {
          "id": 298515,
          "address": "Unit 211 24 Hammonds Plains Road",
          "bedrooms": 2,
          "gla": 925,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B4A 3P3",
          "property_sub_type": "Condo Apartment",
          "structure_type": "Condominium",
          "style": "1 Level",
          "levels": "1 Level",
          "room_count": 5,
          "full_baths": 1,
          "half_baths": 0,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": null,
          "year_built": 1989,
          "roof": "Asphalt Shingle",
          "basement": "None",
          "cooling": "Baseboard",
          "heating": "Baseboard",
          "close_price": 300000.0,
          "close_date": "2025-03-16",
          "public_remarks": "Welcome to this charming 2 bedroom, 1 bath ground floor condo in the heart of beautiful Bedford, Nova Scotia. The open, spacious layout is designed for easy living, with every corner thoughtfully utilized. Step onto your balcony and take in the stunning views of the Bedford Basin, the perfect spot to unwind and soak up the beauty of the surroundings. Enjoy the convenience of in suite laundry, your own assigned parking spot, and exclusive access to the condo’s in ground pool for those sunny summer days. Important to note too, this condo is pet friendly. Just minutes from fantastic shops, restaurants, schools, and all the amenities Bedford has to offer, this condo truly has it all. Don’t miss out, schedule your viewing today!",
          "latitude": 44.7146,
          "longitude": -63.6798
        },
        {
          "id": 296402,
          "address": "107 Shoreview Drive",
          "bedrooms": 4,
          "gla": 1552,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B4A 3E6",
          "property_sub_type": "Detached",
          "structure_type": "Single Family",
          "style": "Side Split",
          "levels": "Side Split",
          "room_count": 10,
          "full_baths": 2,
          "half_baths": 1,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": 9840.0,
          "year_built": 1985,
          "roof": "Asphalt Shingle",
          "basement": "Full, Fully Developed",
          "cooling": "Baseboard, Heat Pump",
          "heating": "Baseboard, Heat Pump",
          "close_price": 596000.0,
          "close_date": "2025-03-18",
          "public_remarks": "Welcome to 107 Shoreview Drive, a magnificent 4 bedroom, 3 bathroom 4 level side split nestled in the highly coveted Basin View School District. This exceptional home features three heat pumps to ensure your comfort during the warm summer days, along with energy-efficient vinyl windows throughout. The top floor boasts 3 bedrooms and 2 full bathrooms, providing ample space and privacy for all family members. Additionally, you'll find a single attached garage for your convenience. The spacious living room and rec room are perfect for entertaining guests or simply unwinding after a long day. Don't miss this opportunity to call this charming residence your own.  Set on a generous lot of nearly 10,000 square feet, this property offers tranquility and seclusion for you and your loved ones",
          "latitude": 44.7282,
          "longitude": -63.6758
        },
        {
          "id": 297849,
          "address": "95 Millrun Crescent",
          "bedrooms": 5,
          "gla": 2413,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B4A 3H9",
          "property_sub_type": "Detached",
          "structure_type": "Single Family",
          "style": "5 Level",
          "levels": "5 Level",
          "room_count": 17,
          "full_baths": 3,
          "half_baths": 1,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": 7400.0,
          "year_built": 1987,
          "roof": "Metal",
          "basement": "Full, Fully Developed, Walkout",
          "cooling": "Radiant, Radiator, Fireplace",
          "heating": "Radiant, Radiator, Fireplace",
          "close_price": 1045000.0,
          "close_date": "2025-03-18",
          "public_remarks": "Welcome to 95 Millrun! Designed by the original architect as their own family’s residence, this one-owner home has been loved & meticulously cared for by the same family for almost 4 decades. Deceivingly low-profile from the street, this spacious family home is impeccably designed for gathering, relaxing, working & enjoying nature all around. This home offers a stylish and spacious living rm on the main lvl, w/ an incredible south facing, curved glass block wall.The 2 sty eat-in kitchen w/ new appliances & stunning, light-filled dining rm overlook Papermill Brook, fed from the lake adjacent. Walk-out to the spacious deck w/ incredible views from this lvl. Upstairs offers a thoughtful layout for family life w/ 3 spacious bdrms + a cozy family rm in the centre; a perfect spot to gather! The primary bdrm includes an ensuite bath & lovely private balcony. The lower lvls offer amazing possibilities for multi-generational living with an additional bdrm, full bath, family room, office, & walkout. Don’t miss the 2 car garage, completely excavated underneath to create an enormous, functional workshop. Just steps from the lifeguarded beach at Papermill Lake, & in a friendly community close to all amenities, this is an incredible opportunity to acquire among the most stylish & unique family homes in Bedford.",
          "latitude": 44.7146,
          "longitude": -63.6829
        },
        {
          "id": 297820,
          "address": "158 Eaglewood Drive",
          "bedrooms": 5,
          "gla": 2494,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B4A 3B2",
          "property_sub_type": "Detached",
          "structure_type": "Single Family",
          "style": "2 Level",
          "levels": "2 Level",
          "room_count": 16,
          "full_baths": 4,
          "half_baths": 0,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": 11029.0,
          "year_built": 1981,
          "roof": "Asphalt Shingle",
          "basement": "Fully Developed",
          "cooling": "Baseboard, Furnace, Heat Pump, Hot Water, Fireplace",
          "heating": "Baseboard, Furnace, Heat Pump, Hot Water, Fireplace",
          "close_price": 1185000.0,
          "close_date": "2025-03-21",
          "public_remarks": "Nestled in the sought-after Eaglewood Subdivision in Bedford, 158 Eaglewood Crescent is the epitome of a family home. Designed for both comfort and style, this stunning property offers inviting spaces perfect for entertaining and family gatherings. The upper level features four spacious bedrooms, including a luxurious primary suite with an ensuite bath and in-floor heating. The main floor boasts a spacious dining room for family dinners, a bright living room off the eat-in kitchen, and an expansive island—ideal for the home cook or baker. The fully finished basement includes a games room, a cozy family room with a wet bar, a fifth bedroom for guests on extended family, and a 3 pc bathroom. Step outside to your private backyard paradise, complete with a playground for the kids, a beautiful deck and patio, and mature trees that enhance the serene oasis.   Adorned with many upgrades - stunning hardwood floors, stone countertops, double wall ovens, main floor 3 pc bathroom and laundry. This home is spectacular, and is ready for a new family to enjoy.",
          "latitude": 44.7246,
          "longitude": -63.6479
        },
        {
          "id": 293093,
          "address": "10 Doyle Street",
          "bedrooms": 2,
          "gla": 1002,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B4A 1K3",
          "property_sub_type": "Detached",
          "structure_type": "Single Family",
          "style": "1.5 Level",
          "levels": "1.5 Level",
          "room_count": 6,
          "full_baths": 1,
          "half_baths": 0,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": 4848.0,
          "year_built": 1926,
          "roof": "Metal",
          "basement": "Undeveloped, Full",
          "cooling": "Baseboard, Heat Pump",
          "heating": "Baseboard, Heat Pump",
          "close_price": 280000.0,
          "close_date": "2025-03-27",
          "public_remarks": "10 Doyle Street is a gorgeous and thoughtfully updated Century home in the heart of Truro. Situated right by Victoria Park, this home is steps from downtown shops and restaurants, the Truro Farmers’ Market, the library and NSCC. This light and bright two-bedroom, one-bath character home features so many upgrades—all the heavy-lifting has already been done. Upgrades include Mitsubishi heat pump, R75 insulation (blown-in, spray foam), metal roof, Cape Cod siding, engineered hardwood upstairs, brand-new luxury vinyl plank kitchen floor, refinished pine floors in the sun porch, new stainless steel fridge, range and range hood, plus plumbing and electrical upgrades. The full-height basement is wired, insulated and drywalled, and includes a workshop area, laundry zone, ample storage and flex space all accessible by a new staircase. The property has a surprisingly large and private backyard, lush garden with deer-resistant, bird- and pollinator-friendly perennials, shrubs and mature trees—even a permanent hammock stand ready for warm summer evenings. 10 Doyle Street also provides easy access to in-town amenities such as hiking, biking, and cross-country ski trails, the sled hill and skateboard park, and recreation and cultural centres.",
          "latitude": 44.7163,
          "longitude": -63.6802
        },
        {
          "id": 294881,
          "address": "112 Basinview Drive",
          "bedrooms": 3,
          "gla": 1627,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B4A 3M8",
          "property_sub_type": "Semi-Detached",
          "structure_type": "Single Family",
          "style": "3 Level",
          "levels": "3 Level",
          "room_count": 11,
          "full_baths": 2,
          "half_baths": 1,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": 3285.0,
          "year_built": 1989,
          "roof": "Asphalt Shingle",
          "basement": "Full, Fully Developed",
          "cooling": "Baseboard",
          "heating": "Baseboard",
          "close_price": 490000.0,
          "close_date": "2025-03-27",
          "public_remarks": "Nestled in a desirable family-friendly neighborhood, this  3-bedroom, 2.5-bathroom  semi -detached home offers both comfort and convenience. The property boasts stunning views of the Basin from the upper levels, with the third floor thoughtfully used as a spacious primary bedroom featuring an ensuite bath and skylights, creating a bright and inviting retreat. Recent updates include new flooring in the kitchen and living room (2024), enhancing the modern and fresh feel of the home. The main living areas are designed for both relaxation and entertaining, with a well-appointed kitchen and an open-concept layout. Step outside to enjoy the privacy of a partially fenced backyard, bordered by established trees that continue to grow, providing natural seclusion. The deck lattice adds an additional layer of privacy, making it an ideal spot for outdoor gatherings or quiet mornings with a coffee. Convenience is key with this property’s prime location. It’s just a one-minute walk to the bus stop and within walking distance to Mill Cove, where you’ll find Sobeys, several restaurants, and a pharmacy. Families will appreciate the proximity to top-rated schools, including Basinview School and Bedford Academy, and the home is also within the catchment for École Beaubassin. A nearby playground adds to the family-friendly appeal. This home combines modern updates, an unique layout, and a highly sought-after location — an ideal choice for families looking to settle into a vibrant community with easy access to essential amenities. Don’t miss the opportunity to make this property your own!",
          "latitude": 44.7195,
          "longitude": -63.6803
        },
        {
          "id": 298345,
          "address": "Unit 408 220 Waterfront Drive",
          "bedrooms": 2,
          "gla": 1374,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B4A 0H3",
          "property_sub_type": "Condo Apartment",
          "structure_type": "Condominium",
          "style": "Multiplex",
          "levels": "Multiplex",
          "room_count": 2,
          "full_baths": 2,
          "half_baths": 0,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": null,
          "year_built": 2013,
          "roof": "Other",
          "basement": "None",
          "cooling": "Baseboard, Heat Pump, Ductless Cooling",
          "heating": "Baseboard, Heat Pump, Ductless Cooling",
          "close_price": 622500.0,
          "close_date": "2025-03-28",
          "public_remarks": "Welcome to The Dockside, where waterfront sophistication meets modern luxury in the heart of Bedford. This 2 bed + den, 2 bath condominium boasts an open-concept layout bathed in natural light from floor-to-ceiling windows, seamlessly integrating the living & dining areas—perfect for entertaining. The kitchen features sleek granite countertops, counter stool seating for 4 and ample cabinetry, while the spacious primary suite offers a custom walk-in closet and 5pc spa-inspired ensuite with a deep soaker tub, glass-enclosed shower & dbl vanity. A well-proportioned 2nd bedroom provides versatility as a guest room or home office, with direct access to the 4pc main bath. Let's not forget in unit laundry room & storage room along with additional storage room in parkade. Step onto your large balcony to relax or indulge in the building’s resort-style amenities, including a heated saltwater pool overlooking the marina, a fitness centre, and a stylish party room with kitchen facilities, all complemented by a live-in superintendent and underground parking. Nestled in the highly sought after community of Bedford, The most sought after condo location in Bedford, The Dockside offers a perfect blend of coastal living with urban conveniences, scenic boardwalk strolls, the Bedford Yacht Club, park events, shopping all within walking distance.",
          "latitude": 44.715,
          "longitude": -63.6732
        },
        {
          "id": 298287,
          "address": "Unit 303 61 Nelsons Landing",
          "bedrooms": 1,
          "gla": 735,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B4A 3X3",
          "property_sub_type": "Condo Apartment",
          "structure_type": "Condominium",
          "style": "1 Level",
          "levels": "1 Level",
          "room_count": 4,
          "full_baths": 1,
          "half_baths": 0,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": null,
          "year_built": 1998,
          "roof": "Tar & Gravel",
          "basement": "Other",
          "cooling": "Baseboard",
          "heating": "Baseboard",
          "close_price": 309900.0,
          "close_date": "2025-03-31",
          "public_remarks": "Bright & Spacious 1-Bedroom Condo in Nelsons Landing- Prime Bedford Location!  Welcome to Nelsons Landing, a well sought-after condo community in the heart of Bedford! This beautifully maintained 1-bedroom, 1-bathroom unit offers an inviting open-concept layout with large windows that flood the space with natural light. The well-appointed kitchen flows seamlessly into the living and dining areas, creating a warm and welcoming atmosphere. The private balcony offers views of the Bedford Basin and is the perfect spot to enjoy your morning coffee or unwind after a long day. Residents of this well-managed building enjoy fantastic amenities including an outdoor pool, a full equipped fitness room, a common room for larger gatherings and ample parking. With its prime location just minutes from shopping, dining, parks, and public transit, this home offers the perfect blend of comfort, convenience and lifestyle. Whether you're a first-time buyer, downsizing, or and investor, this is an opportunity you don't want to miss.",
          "latitude": 44.7119,
          "longitude": -63.6779
        },
        {
          "id": 299987,
          "address": "66 Shoreview Drive",
          "bedrooms": 3,
          "gla": 1035,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B4A 1V5",
          "property_sub_type": "Detached",
          "structure_type": "Single Family",
          "style": "Bungalow",
          "levels": "Bungalow",
          "room_count": 8,
          "full_baths": 2,
          "half_baths": 0,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": 7470.0,
          "year_built": 1980,
          "roof": "Metal",
          "basement": "Full, Fully Developed, Walkout",
          "cooling": "Baseboard, Heat Pump, ETS (Elec Thermal Storage)",
          "heating": "Baseboard, Heat Pump, ETS (Elec Thermal Storage)",
          "close_price": 692000.0,
          "close_date": "2025-04-02",
          "public_remarks": "Located in the desirable Basinview neighbourhood, this tastefully updated bungalow is conveniently located to all schools, shopping, parks, and sport facilities, while still feeling like a private retreat nestled in the trees.  As you step inside, you'll be greeted by a stunning foyer featuring handcrafted mosaic tile flooring and rafter ceilings. The main floors boast beautiful hardwood floors, floor-to-ceiling windows, exposed beams, and a brick fireplace  The spacious kitchen features a custom backsplash and quartz countertops. A bar nook, private back deck, and seamless flow between the living room, dining room, and kitchen... the main level makes a wonderful space for entertaining. The main floor also features a large primary bedroom with a beautiful just renovated full bathroom.  On the lower level, you'll find two bedrooms with laminate flooring, a full bathroom, a modern laundry room, and a large rec room with access to the covered lower-level patio and lush secluded backyard. The home also had a metal roof installed in 2022.",
          "latitude": 44.7285,
          "longitude": -63.6737
        },
        {
          "id": 299074,
          "address": "10 Brockwell Street",
          "bedrooms": 4,
          "gla": 1114,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B4A 2M2",
          "property_sub_type": "Detached",
          "structure_type": "Single Family",
          "style": "Bungalow",
          "levels": "Bungalow",
          "room_count": 10,
          "full_baths": 2,
          "half_baths": 0,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": 15000.0,
          "year_built": 1959,
          "roof": "Asphalt Shingle",
          "basement": "Fully Developed",
          "cooling": "Furnace, Forced Air, Heat Pump",
          "heating": "Furnace, Forced Air, Heat Pump",
          "close_price": 565000.0,
          "close_date": "2025-04-03",
          "public_remarks": "Charming Bungalow on a Spacious 15,000 Sq. Ft. Lot in Bedford. This delightful bungalow offers the perfect blend of convenience and tranquillity. It’s just a short walk to your favourite amenities, including Sunnyside Mall and Bedford Place Mall, yet nestled within an established, peaceful neighborhood. Step onto the covered back deck to enjoy your morning coffee or unwind in the hammock with a good book—this home is designed for relaxation. Inside, the main floor features beautiful hardwood flooring, a bright and spacious living room, a functional kitchen, an adjacent dining room(currently set as an office), a 4 PC bath, and two comfortable bedrooms. A ductless heat pump was added in 2024 to ensure comfortable temperature in all seasons. Downstairs, the fully finished basement provides additional living space with a cozy rec room, two more bedrooms, a brand-new 3 PC bath, and a laundry room. The lower level also offers excellent potential for conversion into an in-law suite for extended family, with plumbing and electrical updates already in place. With RSU zoning and a generously sized lot, there’s even potential to add a garage or a backyard suite—endless possibilities to make this property your own. Homes with this much space and potential are a rare find in Bedford. Don’t miss your chance—schedule a viewing today!",
          "latitude": 44.7305,
          "longitude": -63.6517
        },
        {
          "id": 299961,
          "address": "302 2 Lake Drive",
          "bedrooms": 2,
          "gla": 1146,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B4A 1G1",
          "property_sub_type": "Condo Apartment",
          "structure_type": "Condominium",
          "style": "Multiplex",
          "levels": "Multiplex",
          "room_count": 6,
          "full_baths": 2,
          "half_baths": 0,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": null,
          "year_built": 1998,
          "roof": "Asphalt Shingle",
          "basement": "None",
          "cooling": "Baseboard",
          "heating": "Baseboard",
          "close_price": 504000.0,
          "close_date": "2025-04-10",
          "public_remarks": "Welcome to 2 Lake “Casa Bonavista” unit 302 in Bedford, Halifax Nova Scotia! A spacious 2 bed, 2 bath condo in a highly sought-after Bedford community, overlooking serene Papermill Lake. This bright and well-maintained condo offers over 1,200 sq/ft of living space with a functional layout, large kitchen, and bright living/dining areas and access to your private balcony. Enjoy peaceful lake views, ample in-unit storage, and underground parking. Some recent improvements to the unit include beautiful custom window treatments, painting, brand new washer (2025), & new sinks in the bathrooms! Primary bedroom features a double closet and 4PC ensuite. The secondary bedroom does not have a closet but features ample space for a dresser or amour. The large living room is next to the dining area with a siteline to the kitchen. The utility are and expansive closet in the unit make for impressive storage! Underground parking is a desirable amenity as is easily accessible visitor parking. Quiet, pet-friendly building with excellent condo management. Steps to Papermill Lake Beach, parks, trails, shopping at Mill Cove, Larry Uteck, Bedford Commons, and more. Book your showing today!",
          "latitude": 44.7342,
          "longitude": -63.6551
        },
        {
          "id": 299512,
          "address": "60 Meadowbrook Drive",
          "bedrooms": 3,
          "gla": 1508,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B4A 1R1",
          "property_sub_type": "Detached",
          "structure_type": "Single Family",
          "style": "2 Level",
          "levels": "2 Level",
          "room_count": 9,
          "full_baths": 2,
          "half_baths": 1,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": 73616.0,
          "year_built": 1996,
          "roof": "Asphalt Shingle",
          "basement": "Full, Fully Developed, Walkout",
          "cooling": "Baseboard, Furnace, Heat Pump, Hot Water",
          "heating": "Baseboard, Furnace, Heat Pump, Hot Water",
          "close_price": 645000.0,
          "close_date": "2025-04-12",
          "public_remarks": "Welcome to 60 Meadowbrook Drive in Beaver Bank! This stunning two level home has so much to offer! Main level features a huge Eat-in kitchen with loads of cupboards,  counter space and high end appliances. Convenient patio door leads to your newer back deck which makes barbecuing and entertaining a breeze! Spacious living room with hardwood floors, two great sized bedrooms, full bathroom , master bedroom with an 3 piece en-suite finishes this level. The lower level has been recently renovated which consists of a expansive rec room equipped with a fusion stone wall with Tv mounted and an electric fireplace. New flooring, lighting, freshly painted with more than enough room at add an 4th bedroom, if wanted. Beautiful updated half bathroom with laundry area and a utility room with great storage, completes this level. The home is heated and cooled by an energy efficient Fujitsu ductless heat pump! Outside you’ll notice the 24x24 detached garage that is heated and wired! This property sits on 1.69 acres of privacy and backs onto amazing walking trails with lakes and brooks! Get your side by side ready as there are paths seconds down the road! 5 mins from Lost Creek golf course and a quick commute to all amenities. Curb appeal with the fusion stone added to the front of the home and newer front steps! This home shows pride of ownership and is move in ready!",
          "latitude": 44.7267,
          "longitude": -63.6731
        },
        {
          "id": 299281,
          "address": "13 Dowell Drive",
          "bedrooms": 3,
          "gla": 1295,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B3M 2M2",
          "property_sub_type": "Detached",
          "structure_type": "Single Family",
          "style": "Side Split, 3 Level",
          "levels": "Side Split, 3 Level",
          "room_count": 11,
          "full_baths": 1,
          "half_baths": 1,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": 7700.0,
          "year_built": 1956,
          "roof": "Asphalt Shingle",
          "basement": "Partial, Crawl Space, Partially Developed",
          "cooling": "Baseboard, Furnace, Forced Air, Heat Pump",
          "heating": "Baseboard, Furnace, Forced Air, Heat Pump",
          "close_price": 535000.0,
          "close_date": "2025-04-14",
          "public_remarks": "This charming 3-bedroom home is located in Halifax, just off the Bedford Highway, in a secluded neighborhood that offers both privacy and convenience. the interior & exterior have both been recently painted, new windows, along with a newly paved driveway and front deck, give the property a fresh and welcoming look. A spacious 10' \" 16' shed in the backyard offers plenty of room for storage or hobbies. The home also features a full bathroom upstairs and a convenient half bath on the main level. With easy access to schools, parks, and local amenities, this home is perfectly situated for those seeking a peaceful setting while staying close to everything. Schedule your showing today and discover all this home has to offer!",
          "latitude": 44.7044,
          "longitude": -63.665
        },
        {
          "id": 299931,
          "address": "Unit 403 36 Southgate Drive",
          "bedrooms": 2,
          "gla": 1573,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B4A 4K8",
          "property_sub_type": "Condo Apartment",
          "structure_type": "Condominium",
          "style": "Multiplex, 5 Level",
          "levels": "Multiplex, 5 Level",
          "room_count": 3,
          "full_baths": 2,
          "half_baths": 0,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": null,
          "year_built": 2005,
          "roof": "Other",
          "basement": "None",
          "cooling": "Baseboard, Furnace, Hot Water",
          "heating": "Baseboard, Furnace, Hot Water",
          "close_price": 523000.0,
          "close_date": "2025-04-14",
          "public_remarks": "For more information, please click the \"More Information\" button.  Welcome to “The Tides of Bedford South”. Priced for a quick sale. 1573 sq ft, carpet free, 2 bedroom + Den, privately situated on the back of the building, large private tiled balcony, stunning Bedford Basin water views from all windows. Facing Southeast to catch the sunrise and moonlight over the water. Grandstand views of Canada Day fireworks. Enjoy the sailing races in summer and osprey and eagles gently coasting in the air from the privacy of your own home. Spacious and open concept layout, large Master bedroom has ensuite bathroom and walk-in closet, 2nd bedroom with walk-in closet, family bathroom, in-suite Laundry with full size appliances, large in-suite storage/pantry. Large den with French doors can be used for whatever you need. Updated items include three remote control ceiling fans, updated bathroom light fixtures, bathroom and kitchen sink taps. All appliances and window coverings included. Well managed condominium with good financial standing. 5 story concrete building with sprinkler system throughout. Live-in Superintendent, Intercom and security cameras, 2 elevators, attractive grand foyer with lounge, library, mail area, secure building, heated underground parking, garage level storage locker, heated car wash bay, outside visitor parking, fitness centre with sauna, social room, guest suite, workshop, outdoor heated saltwater pool and patio with deck and BBQ. Landscaped gardens. Close to buses, shops, DeWolfe Park, walking trails and the site of the proposed new bridge and Mill Cove ferry. Small pets welcome. Monthly condominium fees of $738 include heating, AC and hot water, etc. to make your life in “The Tides” relaxing and worry free.",
          "latitude": 44.7107,
          "longitude": -63.6733
        },
        {
          "id": 299733,
          "address": "140 Rutledge Street",
          "bedrooms": 3,
          "gla": 1344,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B4A 1X6",
          "property_sub_type": "Condo Townhouse",
          "structure_type": "Condominium",
          "style": "2 Level",
          "levels": "2 Level",
          "room_count": 5,
          "full_baths": 1,
          "half_baths": 1,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": null,
          "year_built": 1990,
          "roof": "Asphalt Shingle",
          "basement": "None",
          "cooling": "Baseboard, Heat Pump",
          "heating": "Baseboard, Heat Pump",
          "close_price": 399900.0,
          "close_date": "2025-04-15",
          "public_remarks": "OPEN HOUSE SUNDAY March 23 1:30-4  Welcome to 140 Rutledge St. This 3-bedroom, 1.5-bath condo townhouse offers a spacious layout and modern updates in a fantastic Bedford location! The main level features a bright eat-in kitchen, generous living room with fireplace and garden doors to the private back deck, dining room and renovated half bath.  The newly carpeted stairs leads to a sunny second level which features a large primary bedroom with modern flooring and a \"cheater door\" to the updated full bath. This full bath is sure to impress with a pocket door to divide the laundry and second sink from the main bath. Two more bedrooms - also with new flooring - complete this level.  Recent improvements include renovated bathrooms, flooring in many rooms and a heat pump for year-round comfort. With a functional design and incredible location near Bedford's favourite places, this home is perfect for first-time buyers, downsizers, or investors.  This pet friendly condo corp maintains the lawn and takes care of snow removal plus condo fees include water. Enjoy community gardens and the private in-ground pool just a short walk away. Excellent location on a quiet cul-de-sac near bus routes and within walking distance to many of Bedford's favourite places like Izzy's Bagel Co, Propeller Brewing, this home is a must see.",
          "latitude": 44.7275,
          "longitude": -63.6724
        },
        {
          "id": 299753,
          "address": "Unit 406 41 Moirs Mill Road",
          "bedrooms": 2,
          "gla": 941,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B4A 3C4",
          "property_sub_type": "Condo Apartment",
          "structure_type": "Condominium",
          "style": "1 Level",
          "levels": "1 Level",
          "room_count": 6,
          "full_baths": 1,
          "half_baths": 0,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": null,
          "year_built": 1982,
          "roof": "Asphalt Shingle",
          "basement": "None",
          "cooling": "Baseboard, Hot Water",
          "heating": "Baseboard, Hot Water",
          "close_price": 327500.0,
          "close_date": "2025-04-15",
          "public_remarks": "Conveniently located in Bedford, this charming two-bedroom, one-bathroom condo offers both comfort and convenience. Recently updated with fresh paint, new flooring, and modern lighting, this home is move-in ready. The spacious foyer welcomes you into a stylish galley kitchen with lots of cabinets and counter space, perfect for preparing meals with ease. The open-concept dining and living room area is bright and inviting — ideal for entertaining or relaxing — and provides access to a lovely balcony area. Both bedrooms are generously sized with ample closet space, while the updated 4-piece bathroom completes this fantastic condo. Situated close to all amenities and on a bus route, this property offers a lifestyle of ease and comfort. Don't miss out on this wonderful opportunity!",
          "latitude": 44.7132,
          "longitude": -63.6795
        },
        {
          "id": 299430,
          "address": "17 Douglas Drive",
          "bedrooms": 3,
          "gla": 1280,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B4A 1P5",
          "property_sub_type": "Detached",
          "structure_type": "Single Family",
          "style": "Bungalow",
          "levels": "Bungalow",
          "room_count": 4,
          "full_baths": null,
          "half_baths": null,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": 12266.0,
          "year_built": 2009,
          "roof": "Asphalt Shingle",
          "basement": "Fully Developed",
          "cooling": "Forced Air, Heat Pump, Ducted Cooling",
          "heating": "Forced Air, Heat Pump, Ducted Cooling",
          "close_price": 765000.0,
          "close_date": "2025-04-16",
          "public_remarks": "Welcome to 17 Douglas Drive, Bedford. This immaculately maintained bungalow at 17 Douglas Drive offers comfortable, open-concept living in ahighly desirable Bedford location. The bright and spacious kitchen features plenty of cabinets, a central island, and stainless steel appliances, makingit a perfect space for both cooking and entertaining. The dining area flows seamlessly into the living room, where large windows allow for anabundance of natural light. The home offers beautiful hardwood floors throughout the main level. The primary bedroom includes a walk-in closet and a5-piece ensuite, providing a relaxing retreat. An additional bedroom, full bathroom, and convenient laundry room complete the main floor layout.Stepoutside through the patio doors to a spacious deck, ideal for enjoying summer BBQs and a lovely view of the backyard. The lower level offers a largefamily room and rec room with a pool table—great for relaxing or entertaining. You'll also find a third bedroom, full bathroom, and a generous utilityroom for additional storage space.Other key features of the home include a fully ducted heat pump system for year-round comfort, an attached 1.5-cargarage, and a front patio with scenic basin views. Located near all the amenities Bedford has to offer, this home is truly move-in ready.",
          "latitude": 44.7257,
          "longitude": -63.6724
        },
        {
          "id": 299681,
          "address": "6 Mill Court",
          "bedrooms": 3,
          "gla": 1638,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B4A 3A9",
          "property_sub_type": "Detached",
          "structure_type": "Single Family",
          "style": "Cape Cod",
          "levels": "Cape Cod",
          "room_count": 9,
          "full_baths": 2,
          "half_baths": 1,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": 13000.0,
          "year_built": 1980,
          "roof": "Asphalt Shingle",
          "basement": "Fully Developed, Walkout",
          "cooling": "Furnace, Hot Water",
          "heating": "Furnace, Hot Water",
          "close_price": 740000.0,
          "close_date": "2025-04-17",
          "public_remarks": "RARE BEDFORD GEM! You have heard real estate is about location. This beautifully maintained cape cod is found in a desirable community of high end houses that seldom come to the market. Tucked away on a cul de sac at the edge of Papermill Lake.  Enjoy country living with this large parklike lot right in Bedford with municipal services. Listen to the beautiful stream that backs on the property. The neighborhood ducks enjoy it as well. A large deck provides a great space to further enjoy the property. Inside you are surrounded in the warmth of pine. On the main level there is an open concept kitchen that was created in 2016. The updated kitchen with its engineered beams gives this level a wonderful layout opening onto the dining area and cozy family room with a fireplace you can curl up next to. With a generous size living room and 2 piece bathroom to complete this level. Upstairs is a large primary bedroom with vaulted ceilings, 2 additional bedrooms and bathroom with a updated shower (2yrs) The basement provides additional living space including a full bathroom with a jetted tub. A walkout to the backyard as well. Updates include water heater, siding and some windows approx 2yrs ago. Rest of the windows are approx 6 years old. Wired garage completes the property. Don't miss this rare opportunity!",
          "latitude": 44.7152,
          "longitude": -63.683
        },
        {
          "id": 299797,
          "address": "Unit 500 50 Nelsons Landing Boulevard",
          "bedrooms": 2,
          "gla": 1197,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B4A 4K3",
          "property_sub_type": "Condo Apartment",
          "structure_type": "Condominium",
          "style": "1 Level",
          "levels": "1 Level",
          "room_count": 6,
          "full_baths": 2,
          "half_baths": 0,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": null,
          "year_built": 2003,
          "roof": "Metal",
          "basement": "Other",
          "cooling": "Baseboard, Hot Water",
          "heating": "Baseboard, Hot Water",
          "close_price": 372000.0,
          "close_date": "2025-04-17",
          "public_remarks": "Immaculate 2 Bdrm, 2 Bath Condo on the 5th (top Floor) level. This south facing home is bright with natural light also very quite.Features include lots of white kitchen cabinets and loads off space to enjoy your cooking with all appliances included. Flooring is either ceramic or laminate for ease of care. Large master bedroom with a large walk-through closet to a full ensuite with a jacuzzi tub.Open concept with living room and dining very spacious. The laundry room comes with a combo washer/dryer included. Second bedroom/den is separate from master. Patio door open onto an upgraded deck to enjoy BBQ's and just relaxing.Condo fee $447/month including water and underground parking and storage. A must see !",
          "latitude": 44.712,
          "longitude": -63.6767
        },
        {
          "id": 299889,
          "address": "Unit 108 120 Rutledge Street",
          "bedrooms": 2,
          "gla": 950,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B4A 1X6",
          "property_sub_type": "Condo Apartment",
          "structure_type": "Condominium",
          "style": "Multiplex",
          "levels": "Multiplex",
          "room_count": 7,
          "full_baths": 1,
          "half_baths": 0,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": null,
          "year_built": 1991,
          "roof": "Asphalt Shingle",
          "basement": "None",
          "cooling": "Baseboard",
          "heating": "Baseboard",
          "close_price": 310000.0,
          "close_date": "2025-04-22",
          "public_remarks": "Location, Location, Location! Welcome to 120 Rutledge Street, Unit 108—a charming 2-bedroom condo in the heart of Bedford! This condo features an open concept design that floods with natural sunlight, creating a warm and inviting atmosphere. Enjoy the spacious living room, dining area, and kitchen. Step out onto the covered deck from the living room and savor your morning coffee surrounded by greenery. The generous size primary bedroom includes a walk-in closet, accompanied by a good-sized second bedroom, a laundry room, and a full bathroom. Say goodbye to shoveling snow or clearing off your car, as this condo comes with assigned underground parking. Pet-friendly and conveniently located within walking distance to allamenities, on a bus route, and just 20 minutes from downtown Halifax. Condo fees cover water, snow removal, and exterior maintenance. Book your showing today before it's gone!",
          "latitude": 44.7274,
          "longitude": -63.6715
        },
        {
          "id": 299892,
          "address": "Unit 211 2 Lake Drive",
          "bedrooms": 2,
          "gla": 1236,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B4A 1G1",
          "property_sub_type": "Condo Apartment",
          "structure_type": "Condominium",
          "style": "Multiplex",
          "levels": "Multiplex",
          "room_count": 7,
          "full_baths": 2,
          "half_baths": 0,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": null,
          "year_built": 1997,
          "roof": "Asphalt Shingle",
          "basement": "None",
          "cooling": "Baseboard",
          "heating": "Baseboard",
          "close_price": 450000.0,
          "close_date": "2025-04-22",
          "public_remarks": "Come explore this incredible opportunity to own a sought after 2 bed, 2 bath corner unit at Casa Bonavista! Never before offered for sale, this stunning unit offers stylish, updated living overlooking Papermill Lake in the heart of Bedford. Enjoy the enormous, open concept living & dining room & spacious kitchen w/ access to the oversized covered balcony, offering a peaceful & private ever-changing nature view. The generous primary bedroom features double closets & an updated 4pce ensuite bath. Adjacent is the sunny 2nd bedroom, updated main bath w/ convenient in-unit laundry + storage & a large entryway. Freshly painted & immaculately kept, this lovely unit offers upgraded doors, crown moulding & beautiful trim work throughout. Enjoy safe underground parking w/ extra storage, & use of common areas including a gym, library, & common room. Condo fees cover heat, hot water, superintendent & building amenities! This pet-friendly building is ideally located in friendly Bedford, w/ quick access to local amenities on foot or by car, on a bus route, & close to nearby highways. Welcome home!",
          "latitude": 44.7342,
          "longitude": -63.6551
        },
        {
          "id": 299694,
          "address": "17 Vanier Way",
          "bedrooms": 5,
          "gla": 3277,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B4A 0A5",
          "property_sub_type": "Detached",
          "structure_type": "Single Family",
          "style": "2 Level",
          "levels": "2 Level",
          "room_count": 5,
          "full_baths": 3,
          "half_baths": 2,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": 11104.0,
          "year_built": 2006,
          "roof": "Asphalt Shingle",
          "basement": "Fully Developed",
          "cooling": "Radiant, Heat Pump",
          "heating": "Radiant, Heat Pump",
          "close_price": 1045000.0,
          "close_date": "2025-04-25",
          "public_remarks": "Luxurious ICF construction in Shaughnessy, Bedford South.  Graceful, custom-crafted crown molding adds an air of timeless elegance.  4+1 Beds, 5 Baths (2 Ensuites), 2 Office/Den with a double garage, fenced backyard with a beautifully designed garden and a view of the Harbour!  Welcome to this stunning home in one of the most desirable neighbourhoods.  Enter into the sun filled foyer that leads to a spacious Living/Dining area.  Then, walk into the Open Concept, Eat-in Kitchen with granite counter tops and Family Room that shares a double sided fireplace with the Office.  A 2-pc Guest bath completes the main level.  Upstairs you will find 4 comfortable bedrooms, 3 baths, laundry and an Office with a wonderful view of the harbour.  Wait there is more - the basement has another bedroom, full bath and a huge rec room with a built in bar and a large storage area.  Back door opens to the large deck and a fully fenced backyard!   Add this home to your viewing list today.",
          "latitude": 44.7052,
          "longitude": -63.6727
        },
        {
          "id": 299848,
          "address": "Unit 406 647 Bedford Highway",
          "bedrooms": 1,
          "gla": 1068,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B3M 0A5",
          "property_sub_type": "Condo Apartment",
          "structure_type": "Condominium",
          "style": "1 Level",
          "levels": "1 Level",
          "room_count": 1,
          "full_baths": 2,
          "half_baths": 0,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": null,
          "year_built": 2006,
          "roof": "Tile",
          "basement": "None",
          "cooling": "Baseboard",
          "heating": "Baseboard",
          "close_price": 380000.0,
          "close_date": "2025-04-25",
          "public_remarks": "Welcome to modern chic living on the Bedford Highway! This stunning  one bedroom, two bath loft-style condo blends industrial elegance with contemporary comfort. Soaring 18-foot ceilings and dramatic skylights flood the space with natural light, accentuating the rich hardwood floors and sleek design elements throughout. The open-concept main level features a stylish living and dining area that flows effortlessly into a modern kitchen complete with a breakfast bar—perfect for casual dining or entertaining. Upstairs, the lofted primary suite offers a private retreat with an ensuite bath, overlooking the airy living space below. A second full bathroom on the main level adds flexibility for guests. Set in a pet-friendly building and just moments from the water, shops, and dining, this is a vibrant, loft-style condo living at its finest in Bedford.",
          "latitude": 44.6998,
          "longitude": -63.6605
        },
        {
          "id": 299482,
          "address": "17 Rowledge Lane",
          "bedrooms": 3,
          "gla": 2386,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B4A 0J6",
          "property_sub_type": "Detached",
          "structure_type": "Single Family",
          "style": "1 3/4 Storey",
          "levels": "1 3/4 Storey",
          "room_count": 3,
          "full_baths": 2,
          "half_baths": 1,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": 20648.0,
          "year_built": 2019,
          "roof": "Asphalt Shingle",
          "basement": "None",
          "cooling": "Heat Pump, In Floor",
          "heating": "Heat Pump, In Floor",
          "close_price": 770000.0,
          "close_date": "2025-04-29",
          "public_remarks": "Welcome to 17 Rowledge Lane—a refined, custom-crafted estate nestled on a quiet cul-de-sac in one of Bedford’s most coveted enclaves. Built with insulated concrete form (ICF) construction for enhanced durability, efficiency, and peace of mind, this residence offers an exquisite blend of timeless elegance and modern design. From the moment you enter, you're greeted by soaring cathedral ceilings, a striking hardwood staircase, and an open-concept layout that flows effortlessly throughout the main level—designed to offer the ease and comfort of one-level living.  At the heart of the home is a chef-inspired kitchen featuring gleaming quartz countertops, an oversized island, and premium finishes—perfectly suited for both everyday indulgence and elegant entertaining. Step outside onto the composite deck, where you can take in serene views of the lush, tree-lined backyard—a private oasis ideal for relaxation or outdoor gatherings.  The main-floor primary suite is a luxurious retreat, complete with a spa-like ensuite boasting a deep soaker tub, glass-tiled shower, double vanities, and a spacious walk-in closet. With all essential living spaces on the main level—including laundry and access to the heated double garage—this home is perfectly suited for those seeking the convenience of single-level living without compromise.  Upstairs, two generously sized bedrooms are connected by a dramatic mezzanine that overlooks the great room below, while a bonus room above the garage offers endless potential for a home office, gym, or studio. Ideally located just minutes from top-rated schools, fine dining, shopping, and scenic parks, this extraordinary property combines luxurious living with everyday practicality in one of Bedford’s most desirable locations.",
          "latitude": 44.7333,
          "longitude": -63.6606
        },
        {
          "id": 299603,
          "address": "29 Shoreview Drive",
          "bedrooms": 4,
          "gla": 1310,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B4A 1V4",
          "property_sub_type": "Detached",
          "structure_type": "Single Family",
          "style": "Split Entry",
          "levels": "Split Entry",
          "room_count": 13,
          "full_baths": 2,
          "half_baths": 0,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": 7000.0,
          "year_built": 1980,
          "roof": "Asphalt Shingle",
          "basement": "Full, Partially Developed",
          "cooling": "Furnace, Heat Pump, Hot Water, Fireplace",
          "heating": "Furnace, Heat Pump, Hot Water, Fireplace",
          "close_price": 695000.0,
          "close_date": "2025-05-01",
          "public_remarks": "A charming family home nestled in the sought-after community of Bedford. The heart of the home features a sleek, modern kitchen with an open layout and a spacious breakfast bar. Adjacent to the kitchen, the bright dining area is bathed in natural light, creating a warm and inviting space for family meals or gatherings. The generously sized living room offers ample space for relaxation and entertaining. Step outside to an extended patio paired with a charming pergola, offering shaded relaxation or alfresco dining. A propane BBQ invites effortless entertaining, while mature trees and thoughtful landscaping ensure total privacy. On the lower level, the family room is a cozy retreat for movie nights, play time, or a secondary living area. Besides, both levels' energy-efficient zoned heat pumps ensure year-round comfort and cost savings. The propane water boiler is also energy-efficient for cozy winters and low utility bills.",
          "latitude": 44.7303,
          "longitude": -63.6734
        },
        {
          "id": 299782,
          "address": "Unit 307 36 Southgate Drive",
          "bedrooms": 2,
          "gla": 1433,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B4A 4K8",
          "property_sub_type": "Condo Apartment",
          "structure_type": "Condominium",
          "style": "Multiplex",
          "levels": "Multiplex",
          "room_count": 2,
          "full_baths": 2,
          "half_baths": 0,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": null,
          "year_built": 2005,
          "roof": "Tar & Gravel",
          "basement": "None",
          "cooling": "Baseboard, Hot Water, Ducted Cooling",
          "heating": "Baseboard, Hot Water, Ducted Cooling",
          "close_price": 552000.0,
          "close_date": "2025-05-02",
          "public_remarks": "Live the Good Life at The Tides! One of Bedford’s most sought-after and well-managed condo communities, where luxury, convenience, and effortless living come together. This beautifully maintained, move-in-ready 2-bedroom, 2-bathroom plus den suite offers elegant 9’ ceilings, crown moulding, and freshly painted interiors. The modern kitchen featuring elegant cabinetry, luxurious stone countertops, new backsplash, and brand-new appliances. The spacious primary suite includes a walk-in closet and private ensuite, while the versatile den is perfect for a home office, yoga/meditation area, or guest space. Step onto your private balcony to enjoy serene treetop views of the Bedford Ravine and glimpses of Bedford Basin. Additional perks include in-suite laundry, ample storage, and a large assigned storage unit. The Tides boasts exceptional amenities, including a heated saltwater pool, fully equipped gym, sauna, social room, library, guest suite, indoor car wash bay, woodworking shop, and walking trails. This pet-friendly community fosters a vibrant social scene with coffee gatherings, BBQs, potlucks, and game nights. Conveniently located at the foot of Southgate Drive, you’re steps from shopping, dining, recreation, and transit. Condo fees cover heat, hot water, air conditioning, and secure indoor parking—making for a truly stress-free, maintenance-free lifestyle. Skip the yard maintenance and just step outside and enjoy a scenic stroll along the Bedford waterfront. Book your private showing today!",
          "latitude": 44.7107,
          "longitude": -63.6733
        },
        {
          "id": 299914,
          "address": "Unit 610 61 Nelsons Landing Boulevard",
          "bedrooms": 1,
          "gla": 735,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B4A 3X3",
          "property_sub_type": "Condo Apartment",
          "structure_type": "Condominium",
          "style": "Multiplex",
          "levels": "Multiplex",
          "room_count": 5,
          "full_baths": 1,
          "half_baths": 0,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": null,
          "year_built": 1999,
          "roof": "Asphalt Shingle",
          "basement": "None",
          "cooling": "Baseboard, Heat Pump",
          "heating": "Baseboard, Heat Pump",
          "close_price": 282500.0,
          "close_date": "2025-05-07",
          "public_remarks": "Fantastic, convenient Bedford location in walking distance to shopping, amenities and the Bedford Waterfront (ferry coming in 2027!). This one bedroom condo offers a lovely spacious living room, large kitchen with plenty of storage, laminate floors, in-suite laundry, a large bedroom, comfort of a heat pump, & a terrific covered deck to relax on after a long day. This well managed building features a low maintenace condo lifestyle with the convenience of a live-in superintendent. Enjoy the lovely in ground pool outside, fitness center, common room, and a separate storage unit. Located on public transit, this wonderful condo is waiting for you to make it home!",
          "latitude": 44.7119,
          "longitude": -63.6779
        },
        {
          "id": 301141,
          "address": "Unit 104 80 Waterfront Drive",
          "bedrooms": 2,
          "gla": 1220,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B4A 4E4",
          "property_sub_type": "Condo Apartment",
          "structure_type": "Condominium",
          "style": "Multiplex",
          "levels": "Multiplex",
          "room_count": 9,
          "full_baths": 2,
          "half_baths": 0,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": null,
          "year_built": 1999,
          "roof": "Metal",
          "basement": "None",
          "cooling": "Baseboard, Hot Water",
          "heating": "Baseboard, Hot Water",
          "close_price": null,
          "close_date": "2025-05-13",
          "public_remarks": "Welcome to the condos at Queens Gate! Unit 104 at 80 Waterfront Drive offers an exceptional opportunity to enjoy waterfront living in the heart of Bedford. This spacious 2 bedroom, 2 bathroom condo features a thoughtfully designed layout, updated finishes and abundant natural light with windows on both sides of the building. The galley kitchen has been beautifully updated with Corian countertops, additional cabinetry and the cozy dining nook. The dining room flows seamlessly into the living area, offering the perfect space for relaxing or entertaining. Step out onto the oversized terrace, which boasts park views and provides a tranquil setting to enjoy your morning coffee or unwind in the evening. The primary bedroom includes a private den/office with French doors, ideal for working from home or as a quiet retreat. The ensuite bath, also updated with Corian counters, adds a touch of luxury. The second bedroom is thoughtfully positioned for privacy away from the primary with another full bathroom also featuring Corian countertops. Additional conveniences include in-suite laundry, in-unit storage room and assigned underground parking conveniently located near the elevator. The oversized terrace is larger than the balconies in the building! A generous 13’ x 6’ storage locker provides even more space. This pet-friendly, non-smoking building is steps from DeWolf Park, walking paths and a playground making it perfect for anyone seeking a blend of nature and urban amenities. With solid financials, a well-managed condo board and a highly desirable location, Unit 104 is a great find. Don’t miss your chance to own this incredible property in Bedford’s vibrant waterfront community!",
          "latitude": 44.7184,
          "longitude": -63.6717
        },
        {
          "id": 304037,
          "address": "Unit 314 120 Southgate Drive",
          "bedrooms": 2,
          "gla": 1591,
          "city": "Nova Scotia",
          "province": "Nova Scotia",
          "postal_code": "B4A 0B1",
          "property_sub_type": "Condo Apartment",
          "structure_type": "Condominium",
          "style": "Multiplex",
          "levels": "Multiplex",
          "room_count": 2,
          "full_baths": 2,
          "half_baths": 0,
          "main_level_finished_area": null,
          "upper_lvl_fin_area": null,
          "bg_fin_area": null,
          "lot_size_sf": null,
          "year_built": 2007,
          "roof": "Asphalt Shingle",
          "basement": "Full",
          "cooling": "Baseboard, Hot Water, Ducted Cooling",
          "heating": "Baseboard, Hot Water, Ducted Cooling",
          "close_price": null,
          "close_date": "2025-05-13",
          "public_remarks": "The Ravines is highly sought after. This building has it all. Experience luxury at its best in Bedford South. Even better this unit is one of two in the building. Located above the main foyer and library, it has the benefit of no one living below and it is one of the largest units in the building. Experience luxury with the 9 ft ceilings and crown molding. The engineered hardwood flows from the large livingroom/dining area down the halls to the bedrooms. Featuring, 2 bedrooms, a den, 2 bathrooms and ducted cooling. The primary has new vinyl flooring, a large walk in closet and an ensuite bath. The second bedroom and the den/office are both spacious.The balcony features a retractable awning for additional comfort. The laundry area offers lots of extra storage, as does the closet in the front foyer. Condo fees include Heat, Hot water, maintenance, cleaning (common areas). The condo has assigned parking in the garage and a second deeded parking spot in the exterior parking lot.  The extras in this building are endless, library with lots of books for everyone use, a common room, guest suite is available for $50 per night, fitness centre, workshop (with tools!) car wash bay located in the underground garage, and storage units. Let’s not forget the roof top patio! With patio furniture and cushions provided, enjoy the views of Bedford basin. Behind the building is a trail called Old Coach Road Trail. Book your showing today! All offers to be left open for 48 hours.",
          "latitude": 44.7093,
          "longitude": -63.6745
        }
      ]
    ,
  "retrain": false
}
